package curriculum.e;

/**************************************************
* Javaカリキュラム2.22　基礎問題6　Q1　基礎概念
* Javaカリキュラム2.22　基礎問題6　Q2　クラスとオブジェクト
* Javaカリキュラム2.22　基礎問題6　Q3　カプセル化
* Javaカリキュラム2.22　基礎問題6　Q4　継承
* Javaカリキュラム2.22　基礎問題6　Q5　ポリモーフィズム
* Javaカリキュラム2.22　基礎問題6　Q6　インターフェイスと抽象クラス
* Javaカリキュラム2.22　基礎問題6　Q7　オブジェクト指向尾設計原則(SOLID)
**************************************************/

public class Main {
	//mainメソッド
	public static void main(String[] args) {
		//work()呼び出し
		Employee.work( "山田太郎" );
	}

}
